#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/Test_Tariq/gh-actions-demo/runs/run-ctwecrMnYphkHYKr

Waiting for the plan to start...

Terraform v1.3.2
on linux_amd64
Initializing plugins and modules...
random_pet.sg: Refreshing state... [id=evident-teal]
aws_security_group.web-sg: Refreshing state... [id=sg-0fa1bb9419e669d81]
aws_instance.web: Refreshing state... [id=i-013c2a4a83a0eeaa6]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_apprunner_service.hello will be created
  + resource "aws_apprunner_service" "hello" {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + id                             = (known after apply)
      + service_id                     = (known after apply)
      + service_name                   = "hello-app-runner"
      + service_url                    = (known after apply)
      + status                         = (known after apply)
      + tags_all                       = (known after apply)

      + health_check_configuration {
          + healthy_threshold   = (known after apply)
          + interval            = (known after apply)
          + path                = (known after apply)
          + protocol            = (known after apply)
          + timeout             = (known after apply)
          + unhealthy_threshold = (known after apply)
        }

      + instance_configuration {
          + cpu               = (known after apply)
          + instance_role_arn = (known after apply)
          + memory            = (known after apply)
        }

      + network_configuration {
          + egress_configuration {
              + egress_type       = (known after apply)
              + vpc_connector_arn = (known after apply)
            }
        }

      + source_configuration {
          + auto_deployments_enabled = false

          + image_repository {
              + image_identifier      = "public.ecr.aws/aws-containers/hello-app-runner:latest"
              + image_repository_type = "ECR_PUBLIC"

              + image_configuration {
                  + port = "8000"
                }
            }
        }
    }

  # aws_instance.web will be destroyed
  # (because aws_instance.web is not in configuration)
  - resource "aws_instance" "web" {
      - ami                                  = "ami-05cf62c5375f68022" -> null
      - arn                                  = "arn:aws:ec2:us-east-1:511073568994:instance/i-013c2a4a83a0eeaa6" -> null
      - associate_public_ip_address          = true -> null
      - availability_zone                    = "us-east-1d" -> null
      - cpu_core_count                       = 1 -> null
      - cpu_threads_per_core                 = 1 -> null
      - disable_api_stop                     = false -> null
      - disable_api_termination              = false -> null
      - ebs_optimized                        = false -> null
      - get_password_data                    = false -> null
      - hibernation                          = false -> null
      - id                                   = "i-013c2a4a83a0eeaa6" -> null
      - instance_initiated_shutdown_behavior = "stop" -> null
      - instance_state                       = "running" -> null
      - instance_type                        = "t2.micro" -> null
      - ipv6_address_count                   = 0 -> null
      - ipv6_addresses                       = [] -> null
      - monitoring                           = false -> null
      - primary_network_interface_id         = "eni-04692892bf40e79de" -> null
      - private_dns                          = "ip-172-31-80-141.ec2.internal" -> null
      - private_ip                           = "172.31.80.141" -> null
      - public_dns                           = "ec2-54-173-220-72.compute-1.amazonaws.com" -> null
      - public_ip                            = "54.173.220.72" -> null
      - secondary_private_ips                = [] -> null
      - security_groups                      = [
          - "evident-teal-sg",
        ] -> null
      - source_dest_check                    = true -> null
      - subnet_id                            = "subnet-080df2696762d3c94" -> null
      - tags                                 = {} -> null
      - tags_all                             = {} -> null
      - tenancy                              = "default" -> null
      - user_data                            = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0" -> null
      - vpc_security_group_ids               = [
          - "sg-0fa1bb9419e669d81",
        ] -> null

      - capacity_reservation_specification {
          - capacity_reservation_preference = "open" -> null
        }

      - credit_specification {
          - cpu_credits = "standard" -> null
        }

      - enclave_options {
          - enabled = false -> null
        }

      - maintenance_options {
          - auto_recovery = "default" -> null
        }

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
          - instance_metadata_tags      = "disabled" -> null
        }

      - private_dns_name_options {
          - enable_resource_name_dns_a_record    = false -> null
          - enable_resource_name_dns_aaaa_record = false -> null
          - hostname_type                        = "ip-name" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 100 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-0f639ffe630a413e2" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_security_group.web-sg will be destroyed
  # (because aws_security_group.web-sg is not in configuration)
  - resource "aws_security_group" "web-sg" {
      - arn                    = "arn:aws:ec2:us-east-1:511073568994:security-group/sg-0fa1bb9419e669d81" -> null
      - description            = "Managed by Terraform" -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-0fa1bb9419e669d81" -> null
      - ingress                = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = ""
              - from_port        = 8080
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 8080
            },
        ] -> null
      - name                   = "evident-teal-sg" -> null
      - owner_id               = "511073568994" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
      - vpc_id                 = "vpc-0f6f46ea0bd0aedf0" -> null
    }

  # random_pet.sg will be destroyed
  # (because random_pet.sg is not in configuration)
  - resource "random_pet" "sg" {
      - id        = "evident-teal" -> null
      - length    = 2 -> null
      - separator = "-" -> null
    }

Plan: 1 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  + apprunner_service_hello = {
      + arn                            = (known after apply)
      + auto_scaling_configuration_arn = (known after apply)
      + encryption_configuration       = []
      + health_check_configuration     = (known after apply)
      + id                             = (known after apply)
      + instance_configuration         = (known after apply)
      + network_configuration          = (known after apply)
      + observability_configuration    = []
      + service_id                     = (known after apply)
      + service_name                   = "hello-app-runner"
      + service_url                    = (known after apply)
      + source_configuration           = [
          + {
              + authentication_configuration = []
              + auto_deployments_enabled     = false
              + code_repository              = []
              + image_repository             = [
                  + {
                      + image_configuration   = [
                          + {
                              + port                          = "8000"
                              + runtime_environment_variables = null
                              + start_command                 = null
                            },
                        ]
                      + image_identifier      = "public.ecr.aws/aws-containers/hello-app-runner:latest"
                      + image_repository_type = "ECR_PUBLIC"
                    },
                ]
            },
        ]
      + status                         = (known after apply)
      + tags                           = null
      + tags_all                       = (known after apply)
    }
  - web-address             = "ec2-54-173-220-72.compute-1.amazonaws.com:8080" -> null

```

</details>

*Pushed by: @Tarique-B, Action: `pull_request`*